app/controllers/products_controller.rb

INSERT INTO `products` (`created_at`, `unit_price`, `updated_at`, `name`) VALUES('2013-11-05 13:05:11', 200, '2013-11-05 13:05:11', 'ipod')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT * FROM `products` WHERE (`products`.`id` = 3)
UPDATE `products` SET `unit_price` = 20022, `updated_at` = '2013-11-11 12:28:26' WHERE `id` = 1
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])