app/controllers/utentes_controller.rb

  def index
    @utentes = Utente.all
---
SELECT * FROM `utentes`

  def show
    @utente = Utente.find(params[:id])
---
SELECT * FROM `utentes` WHERE (`utentes`.`id` = 1)

  def edit
    @utente = Utente.find(params[:id])
---
SELECT * FROM `utentes` WHERE (`utentes`.`id` = 1)

  def create
    @utente = Utente.new(params[:utente])

    respond_to do |format|
      if @utente.save
---
INSERT INTO `utentes` (`created_at`, `nome`, `updated_at`, `cognome`) VALUES('2013-11-03 20:59:07', 'mario', '2013-11-03 20:59:07', 'rossi')

  def update
    @utente = Utente.find(params[:id])

    respond_to do |format|
      if @utente.update_attributes(params[:utente])
---
SELECT * FROM `utentes` WHERE (`utentes`.`id` = 1)
UPDATE `utentes` SET `cognome` = 'verdi', `updated_at` = '2013-11-03 23:33:29' WHERE `id` = 1

  def destroy
    @utente = Utente.find(params[:id])
    @utente.destroy
---
SELECT * FROM `utentes` WHERE (`utentes`.`id` = 3)
DELETE FROM `utentes` WHERE `id` = 3